# ModifiedLinkedFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..ModifiedLinkedFile Property
BuiltInFailures..::..LinkFailures Class See Also
---
Shared Sites in the link have been modified, use move instance to reset the change.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ModifiedLinkedFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModifiedLinkedFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ModifiedLinkedFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace